avr-rust/avrd/packs/xmegaa/ATxmega64A3U.atdf
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x02" size="1"/>
        <register caption="General Purpose IO Register 3" name="GPIOR3" offset="0x03" size="1"/>
        <register caption="General Purpose IO Register 4" name="GPIOR4" offset="0x04" size="1"/>
        <register caption="General Purpose IO Register 5" name="GPIOR5" offset="0x05" size="1"/>
        <register caption="General Purpose IO Register 6" name="GPIOR6" offset="0x06" size="1"/>
        <register caption="General Purpose IO Register 7" name="GPIOR7" offset="0x07" size="1"/>
        <register caption="General Purpose IO Register 8" name="GPIOR8" offset="0x08" size="1"/>
        <register caption="General Purpose IO Register 9" name="GPIOR9" offset="0x09" size="1"/>
        <register caption="General Purpose IO Register 10" name="GPIORA" offset="0x0A" size="1"/>
        <register caption="General Purpose IO Register 11" name="GPIORB" offset="0x0B" size="1"/>
        <register caption="General Purpose IO Register 12" name="GPIORC" offset="0x0C" size="1"/>
        <register caption="General Purpose IO Register 13" name="GPIORD" offset="0x0D" size="1"/>
        <register caption="General Purpose IO Register 14" name="GPIORE" offset="0x0E" size="1"/>
        <register caption="General Purpose IO Register 15" name="GPIORF" offset="0x0F" size="1"/>
      </register-group>
    </module>
    <module name="VPORT" id="I6075" version="XMEGAAU" caption="Virtual Ports">
      <register-group caption="Virtual Port" name="VPORT" size="4">
        <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
        <register caption="I/O Port Output" name="OUT" offset="0x01" size="1"/>
        <register caption="I/O Port Input" name="IN" offset="0x02" size="1"/>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
          <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
        </register>
      </register-group>
    </module>
    <module 
      xmlns:xi="http://www.w3.org/2001/XInclude" name="XOCD" caption="On-Chip Debug System" id="I6043">
      <register-group name="OCD" caption="On-Chip Debug System" size="2">
        <register name="OCDR0" caption="OCD Register 0" size="1" offset="0x00">
          <bitfield name="OCDRD" caption="OCDR Dirty" mask="0xFF"/>
        </register>
        <register name="OCDR1" caption="OCD Register 1" size="1" offset="0x01">
          <bitfield name="OCDRD" caption="OCDR Dirty" mask="0x01"/>
        </register>
      </register-group>
    </module>
    <module name="CPU" id="I6000" caption="CPU">
      <register-group caption="CPU registers" name="CPU" size="16">
        <register caption="Configuration Change Protection" name="CCP" offset="0x04" size="1">
          <bitfield caption="CCP signature" mask="0xFF" name="CCP" values="CCP"/>
        </register>
        <register caption="Ramp D" name="RAMPD" offset="0x08" size="1"/>
        <register caption="Ramp X" name="RAMPX" offset="0x09" size="1"/>
        <register caption="Ramp Y" name="RAMPY" offset="0x0A" size="1"/>
        <register caption="Ramp Z" name="RAMPZ" offset="0x0B" size="1"/>
        <register caption="Extended Indirect Jump" name="EIND" offset="0x0C" size="1"/>
        <register caption="Stack Pointer Low" name="SPL" offset="0x0D" size="1"/>
        <register caption="Stack Pointer High" name="SPH" offset="0x0E" size="1"/>
        <register caption="Status Register" name="SREG" offset="0x0F" size="1">
          <bitfield caption="Global Interrupt Enable Flag" mask="0x80" name="I"/>
          <bitfield caption="Transfer Bit" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="N Exclusive Or V Flag" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
      </register-group>
      <value-group caption="CCP signatures" name="CCP">
        <value caption="SPM Instruction Protection" name="SPM" value="0x9D"/>
        <value caption="IO Register Protection" name="IOREG" value="0xD8"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V3XJ"/>
      </parameters>
    </module>
    <module name="CLK" id="I6073" version="XMEGAAU" caption="Clock System">
      <register-group caption="Clock System" name="CLK" size="5">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="System Clock Selection" mask="0x07" name="SCLKSEL" values="CLK_SCLKSEL"/>
        </register>
        <register caption="Prescaler Control Register" name="PSCTRL" offset="0x01" size="1">
          <bitfield caption="Prescaler A Division Factor" mask="0x7C" name="PSADIV" values="CLK_PSADIV"/>
          <bitfield caption="Prescaler B and C Division factor" mask="0x03" name="PSBCDIV" values="CLK_PSBCDIV"/>
        </register>
        <register caption="Lock register" name="LOCK" offset="0x02" size="1">
          <bitfield caption="Clock System Lock" mask="0x01" name="LOCK"/>
        </register>
        <register caption="RTC Control Register" name="RTCCTRL" offset="0x03" size="1">
          <bitfield caption="Clock Source" mask="0x0E" name="RTCSRC" values="CLK_RTCSRC"/>
          <bitfield caption="Clock Source Enable" mask="0x01" name="RTCEN"/>
        </register>
        <register caption="USB Control Register" name="USBCTRL" offset="0x04" size="1">
          <bitfield caption="Prescaler Division Factor" mask="0x38" name="USBPSDIV" values="CLK_USBPSDIV"/>
          <bitfield caption="Clock Source" mask="0x06" name="USBSRC" values="CLK_USBSRC"/>
          <bitfield caption="Clock Source Enable" mask="0x01" name="USBSEN"/>
        </register>
      </register-group>
      <value-group caption="System Clock Selection" name="CLK_SCLKSEL">
        <value caption="Internal 2 MHz RC Oscillator" name="RC2M" value="0x00"/>
        <value caption="Internal 32 MHz RC Oscillator" name="RC32M" value="0x01"/>
        <value caption="Internal 32.768 kHz RC Oscillator" name="RC32K" value="0x02"/>
        <value caption="External Crystal Oscillator or Clock" name="XOSC" value="0x03"/>
        <value caption="Phase Locked Loop" name="PLL" value="0x04"/>
      </value-group>
