avr-rust/avrd/packs/xmegaa/ATxmega64A3U.atdf
        <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x06" size="1">
          <bitfield caption="High Byte Underflow Interrupt Level" mask="0x0C" name="HUNFINTLVL" values="TC2_HUNFINTLVL"/>
          <bitfield caption="Low Byte Underflow interrupt level" mask="0x03" name="LUNFINTLVL" values="TC2_LUNFINTLVL"/>
        </register>
        <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x07" size="1">
          <bitfield caption="Low Byte Compare D Interrupt Level" mask="0xC0" name="LCMPDINTLVL" values="TC2_LCMPDINTLVL"/>
          <bitfield caption="Low Byte Compare C Interrupt Level" mask="0x30" name="LCMPCINTLVL" values="TC2_LCMPCINTLVL"/>
          <bitfield caption="Low Byte Compare B Interrupt Level" mask="0x0C" name="LCMPBINTLVL" values="TC2_LCMPBINTLVL"/>
          <bitfield caption="Low Byte Compare A Interrupt Level" mask="0x03" name="LCMPAINTLVL" values="TC2_LCMPAINTLVL"/>
        </register>
        <register caption="Control Register F" name="CTRLF" offset="0x09" size="1">
          <bitfield caption="Command" mask="0x0C" name="CMD" values="TC2_CMD"/>
          <bitfield caption="Command Enable" mask="0x03" name="CMDEN" values="TC2_CMDEN"/>
        </register>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Low Byte Compare D Interrupt Flag" mask="0x80" name="LCMPDIF"/>
          <bitfield caption="Low Byte Compare C Interrupt Flag" mask="0x40" name="LCMPCIF"/>
          <bitfield caption="Low Byte Compare B Interrupt Flag" mask="0x20" name="LCMPBIF"/>
          <bitfield caption="Low Byte Compare A Interrupt Flag" mask="0x10" name="LCMPAIF"/>
          <bitfield caption="High Byte Underflow Interrupt Flag" mask="0x02" name="HUNFIF"/>
          <bitfield caption="Low Byte Underflow Interrupt Flag" mask="0x01" name="LUNFIF"/>
        </register>
        <register caption="Low Byte Count" name="LCNT" offset="0x20" size="1"/>
        <register caption="High Byte Count" name="HCNT" offset="0x21" size="1"/>
        <register caption="Low Byte Period" name="LPER" offset="0x26" size="1"/>
        <register caption="High Byte Period" name="HPER" offset="0x27" size="1"/>
        <register caption="Low Byte Compare A" name="LCMPA" offset="0x28" size="1"/>
        <register caption="High Byte Compare A" name="HCMPA" offset="0x29" size="1"/>
        <register caption="Low Byte Compare B" name="LCMPB" offset="0x2A" size="1"/>
        <register caption="High Byte Compare B" name="HCMPB" offset="0x2B" size="1"/>
        <register caption="Low Byte Compare C" name="LCMPC" offset="0x2C" size="1"/>
        <register caption="High Byte Compare C" name="HCMPC" offset="0x2D" size="1"/>
        <register caption="Low Byte Compare D" name="LCMPD" offset="0x2E" size="1"/>
        <register caption="High Byte Compare D" name="HCMPD" offset="0x2F" size="1"/>
      </register-group>
      <value-group caption="Clock Selection" name="TC2_CLKSEL">
        <value caption="Timer Off" name="OFF" value="0x00"/>
        <value caption="System Clock" name="DIV1" value="0x01"/>
        <value caption="System Clock / 2" name="DIV2" value="0x02"/>
        <value caption="System Clock / 4" name="DIV4" value="0x03"/>
        <value caption="System Clock / 8" name="DIV8" value="0x04"/>
        <value caption="System Clock / 64" name="DIV64" value="0x05"/>
        <value caption="System Clock / 256" name="DIV256" value="0x06"/>
        <value caption="System Clock / 1024" name="DIV1024" value="0x07"/>
        <value caption="Event Channel 0" name="EVCH0" value="0x08"/>
        <value caption="Event Channel 1" name="EVCH1" value="0x09"/>
        <value caption="Event Channel 2" name="EVCH2" value="0x0A"/>
        <value caption="Event Channel 3" name="EVCH3" value="0x0B"/>
        <value caption="Event Channel 4" name="EVCH4" value="0x0C"/>
        <value caption="Event Channel 5" name="EVCH5" value="0x0D"/>
        <value caption="Event Channel 6" name="EVCH6" value="0x0E"/>
        <value caption="Event Channel 7" name="EVCH7" value="0x0F"/>
      </value-group>
      <value-group caption="Byte Mode" name="TC2_BYTEM">
        <value caption="16-bit mode" name="NORMAL" value="0x00"/>
        <value caption="Timer/Counter operating in byte mode only (TC2)" name="BYTEMODE" value="0x01"/>
        <value caption="Timer/Counter split into two 8-bit Counters" name="SPLITMODE" value="0x02"/>
      </value-group>
      <value-group caption="High Byte Underflow Interrupt Level" name="TC2_HUNFINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Low Byte Underflow Interrupt Level" name="TC2_LUNFINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Low Byte Compare D Interrupt Level" name="TC2_LCMPDINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Low Byte Compare C Interrupt Level" name="TC2_LCMPCINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Low Byte Compare B Interrupt Level" name="TC2_LCMPBINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Low Byte Compare A Interrupt Level" name="TC2_LCMPAINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Timer/Counter Command" name="TC2_CMD">
        <value caption="No Command" name="NONE" value="0x00"/>
        <value caption="Force Restart" name="RESTART" value="0x02"/>
        <value caption="Force Hard Reset" name="RESET" value="0x03"/>
      </value-group>
      <value-group caption="Timer/Counter Command" name="TC2_CMDEN">
        <value caption="Low Byte Timer/Counter" name="LOW" value="0x01"/>
        <value caption="High Byte Timer/Counter" name="HIGH" value="0x02"/>
        <value caption="Both Low Byte and High Byte Timer/Counters" name="BOTH" value="0x03"/>
      </value-group>
      <interrupt-group name="TC2">
        <interrupt index="0" name="LUNF" caption="Low Byte Underflow Interrupt"/>
        <interrupt index="1" name="HUNF" caption="High Byte Underflow Interrupt"/>
        <interrupt index="2" name="LCMPA" caption="Low Byte Compare A Interrupt"/>
        <interrupt index="3" name="LCMPB" caption="Low Byte Compare B Interrupt"/>
        <interrupt index="4" name="LCMPC" caption="Low Byte Compare C Interrupt"/>
        <interrupt index="5" name="LCMPD" caption="Low Byte Compare D Interrupt"/>
      </interrupt-group>
    </module>
    <module name="AWEX" id="I6090" version="XMEGAAU" caption="Timer/Counter Advanced Waveform Extension">
      <register-group caption="Advanced Waveform Extension" name="AWEX" size="13">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Pattern Generation Mode" mask="0x20" name="PGM"/>
          <bitfield caption="Common Waveform Channel Mode" mask="0x10" name="CWCM"/>
          <bitfield caption="Dead Time Insertion Compare Channel D Enable" mask="0x08" name="DTICCDEN"/>
          <bitfield caption="Dead Time Insertion Compare Channel C Enable" mask="0x04" name="DTICCCEN"/>
          <bitfield caption="Dead Time Insertion Compare Channel B Enable" mask="0x02" name="DTICCBEN"/>
          <bitfield caption="Dead Time Insertion Compare Channel A Enable" mask="0x01" name="DTICCAEN"/>
        </register>
